## Plan Result (sbox-00-genesis)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.genesis.azurerm_key_vault.key_vault
  * module.genesis.azurerm_resource_group.genesis_resource_group




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.genesis.data.null_data_source.key_vault_outputs will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "null_data_source" "key_vault_outputs" {
      + has_computed_default = (known after apply)
      + id                   = (known after apply)
      + inputs               = {
          + "azurerm_key_vault_id" = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dtssharedservicessboxkv"
        }
      + outputs              = (known after apply)
      + random               = (known after apply)
    }

  # module.genesis.azurerm_key_vault.key_vault will be updated in-place
  ~ resource "azurerm_key_vault" "key_vault" {
        id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dtssharedservicessboxkv"
        name                            = "dtssharedservicessboxkv"
      ~ tags                            = {
          + "expiresAfter" = "3000-01-01"
            # (5 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.genesis.azurerm_resource_group.genesis_resource_group will be updated in-place
  ~ resource "azurerm_resource_group" "genesis_resource_group" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/genesis-rg"
        name     = "genesis-rg"
      ~ tags     = {
          + "expiresAfter" = "3000-01-01"
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":352,"Program":"tfcmt","SHA1":"","Target":"sbox-00-genesis","Vars":{}} -->